'use client'

import { useState } from 'react'

const details = [
	{
		title: 'Сопровождение деятельности',
		items: [
			'Консультации',
			'Правовая экспертиза и разработка внутренней документации',
			'Правовой анализ хозяйственной деятельности предприятия, оптимизация налогообложения',
			'Представление интересов в государственных органах и иных организациях',
			'Разработка проектов договоров, экспертиза правовых документов и оценка рисков',
			'Сопровождение сделок, инвестиционных проектов и т.п.',
			'Ведение претензионной работы и иной деловой переписки',
			'Представительство в судебных органах',
			'Регистрация, реорганизация, ликвидация предприятия',
		],
	},
	{
		title: 'Взыскание долгов',
		items: [
			'Досудебное урегулирование: правовой анализ ситуации, определение материального состояния должника и оценка перспективы взыскания',
			'Определение местонахождения должника, в том числе его розыск',
			'Подготовка и направление должнику письменных претензий, уведомлений о наличии долга и обязанности его вернуть, в том числе телефонные переговоры и выезд к должнику',
			'Судебная процедура возврата долга',
			'Правовой анализ ситуации, определение материального состояния должника и оценка перспективы взыскания',
			'Представительство в суде на всех стадиях судебного разбирательства',
			'Принятие мер по обеспечению иска о взыскании задолженности',
		],
	},
	{
		title: 'Оспаривание действий гос. органов',
		items: [
			'Оспаривание действий государственных органов',
			'Установление юридических фактов',
			'Оспаривание решений третейских судов, МИФНС, УФАС, Таможенных органов и др.',
			'Представление интересов в спорах в области страхования',
			'Представление интересов в спорах в сфере интеллектуальной собственности',
			'Представление интересов в рамках административного и уголовного преследования',
		],
	},
	{
		title: 'Банкротство',
		items: [
			'Правовой анализ экономического состояния юридического лица (ООО, ЗАО, ОАО) или индивидуального предпринимателя (ИП), являющегося кредитором, либо должником',
			'Оценка рыночной стоимости предприятий (бизнеса, акций, недвижимости и других активов)',
			'Оценка преимущества процедуры банкротства по сравнению с иными способами решения проблем неплатежеспособности',
			'Представление интересов кредитора при банкротстве должника',
			'Участие в собраниях кредиторов, разработка плана проведения процедуры реструктуризации, обжалование включения в реестр требований иных кредиторов',
			'Участие в судебном процессе на стадиях реструктуризации долга и реализации имущества должника',
			'Подбор арбитражного управляющего и взаимодействие с ним',
			'Представление интересов должника, выбор наиболее подходящего способа банкротства предприятия',
		],
	},
	{
		title: 'Исполнительное производство',
		items: [
			'Подача исполнительного листа в службу судебных приставов для возбуждения исполнительного производства',
			'Розыск имущества и других активов должника',
			'Взаимодействие с судебными приставами, контроль взыскания',
			'Представление интересов Клиента по обжалование действий (бездействий) судебного пристава-исполнителя в суде',
		],
	},
	{
		title: 'Корпоративные споры',
		items: [
			'Нарушение прав акционеров, участников',
			'Выкуп акций, а также преимущественное право покупки акций',
			'Выкуп доли участников',
			'Внесение записей в реестр акционеров или аннулирование записей',
			'Формирование уставного капитала',
			'Выплата дивидендов, в том числе по искам вышедших участников',
			'Выплата номинальной стоимости доли участника при выходе или исключении такого участника из общества',
			'Признание недействительными собраний акционеров и собраний директоров',
			'Обжалование решений органов управления юридического лица',
			'Признание недействительными сделок, совершаемых обществом',
			'Признании недействительной записи, внесенной в ЕГРЮЛ',
			'Признание недействительными решений о создании обществ, устава и учредительных документов',
		],
	},
	{
		title: 'Защита права собственности на недвижимость',
		items: [
			'Сопровождение сделок с недвижимым имуществом, включая сделки купли-продажи, мены, дарения, аренды, залога (ипотеки)',
			'Правовая экспертиза и разработка оптимальных правовых схем реализации (приобретения) объекта недвижимости',
			'Регистрация прав на недвижимость, на земельный участок',
			'Приватизация квартир, комнат, объектов нежилого фонда и земельных участков',
			'Ведение дел в судах общей юрисдикции и арбитражных судах',
			'Разработка и осуществление плана мероприятий по разрешению правовых конфликтов, связанных с объектами недвижимости',
		],
	},
	{
		title: 'Защита интеллектуальной собственности',
		items: [
			'Регистрация, депонирование прав на результаты интеллектуальной деятельности: изобретения, полезные модели, промышленные образцы, товарные знаки и торговые марки',
			'Представительство в ходе урегулирования споров о праве собственности в досудебном порядке',
			'Разработка, экспертиза лицензионных договоров, авторских соглашений, договоров о передаче исключительных прав',
			'Подготовка положений о коммерческой тайне, уведомление сотрудников',
			'Представительство в арбитражных судах и в судах общей юрисдикции по защите интеллектуальной собственности',
			'Представительство в арбитражных судах и в судах общей юрисдикции по защите чести, достоинства, деловой репутации',
			'Консультирование в сфере рекламной деятельности',
		],
	},
	{
		title: 'Признание сделок недействительными',
		items: [
			'Нецелевое расходование средств директором',
			'Взыскание ущерба и убытков с генерального директора',
			'Изменение, либо признание недействительным концессионного соглашения – доказательства его убыточности для предприятия',
			'Изменение, либо признание недействительным договора лизинга – доказательство его убыточности для предприятия',
			'Изменение, либо признание недействительным договоров купли-продажи движимого и недвижимого имущества',
			'Изменение, либо признание недействительным договоров подряда, перевозки, экспедиции',
			'Признание любых иных сделок в судебном порядке оспоримыми или ничтожными в силу закона',
		],
	},
]

const LegalServicesToBusiness = () => {
	const [openIndexes, setOpenIndexes] = useState<number[]>([])
	const toggleHeading = (index: number) => {
		setOpenIndexes(prevIndexes =>
			prevIndexes.includes(index)
				? prevIndexes.filter(i => i !== index)
				: [...prevIndexes, index]
		)
	}
	return (
		<div className='grid md:grid-cols-3 gap-8'>
			{details.map((detail, index) => (
				<div key={index}>
					<h4
						className={`text-xl font-medium font-prata text-detailsPointTitle mb-6 
							transition-all duration-500 ease-in-out 
							cursor-pointer 
							${openIndexes.includes(index) ? 'border-b-2 border-gray-500 pb-2' : ''}`}
						onClick={() => toggleHeading(index)}
					>
						{detail.title}
					</h4>

					{openIndexes.includes(index) && (
						<ul className='pl-[20px] space-y-4 text-sm'>
							{detail.items.map((item, index) => (
								<li className='flex items-start' key={index}>
									<span className=' mr-2 flex-shrink-0'>•</span>
									<div>{item}</div>
								</li>
							))}
						</ul>
					)}
				</div>
			))}
		</div>
	)
}

export default LegalServicesToBusiness
